---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCData
source: html/34762033-771a-ebee-bd69-509c55ae78f0.htm
---
# Autodesk.Revit.DB.IFC.IFCData

A specialized type of abstract data block that can represent any data type.

## Syntax (C#)
```csharp
public class IFCData : IDisposable
```